[
  {
    "step_id": "day-01",
    "step_type": "INFO",
    "title": "Active Directory Logical Structure: Forests, Trees, and Domains",
    "estimated_time_minutes": 25,
    "goal": "Learn about Active Directory Logical Structure: Forests, Trees, and Domains and understand: A forest is a top-level container of one or more domains sharing schema, configuration, and a global.",
    "actions": [
      "Read: Understanding the Active Directory Logical Model - https://learn.microsoft.com/en-us/windows-server/identity/ad-ds/plan/understanding-the-active-directory-logical-model (5 min)\n   Key concepts to note:\n   • A forest is a top-level container of one or more domains sharing schema, configuration, and a global catalog\n   • Domains in the same forest are linked by automatic two-way, transitive trust relationships\n   • A domain is a partition that stores user accounts, provides authentication, replication, and authorization data",
      "Practice: Follow along with a basic Active Directory Logical Structure: Forests, Trees, and Domains configuration example (15 min)",
      "Self-test: Without looking at notes, explain Active Directory Logical Structure: Forests, Trees, and Domains to an imaginary coworker in 2-3 sentences (5 min)"
    ],
    "completion_check": "Can explain Active Directory Logical Structure: Forests, Trees, and Domains in your own words and completed the practice exercise",
    "resource_refs": [
      "https://learn.microsoft.com/en-us/windows-server/identity/ad-ds/plan/understanding-the-active-directory-logical-model",
      "https://rootdse.org/posts/active-directory-lab-setup-part1/",
      "https://www.youtube.com/watch?v=k24C0g-B-5c"
    ],
    "domain": "Active Directory",
    "subdomain": "Active Directory Logical Structure: Forests, Trees, and Domains",
    "subdomains_covered": [
      "Active Directory Logical Structure: Forests, Trees, and Domains"
    ],
    "subtopics": [],
    "day_number": null
  },
  {
    "step_id": "day-02",
    "step_type": "INFO",
    "title": "Active Directory Objects and Attributes: Users, Computers, and Groups",
    "estimated_time_minutes": 26,
    "goal": "Learn about Active Directory Objects and Attributes: Users, Computers, and Groups and understand: cn is the group's Common-Name, its relative distinguished name, and must be unique among sibling obj.",
    "actions": [
      "Read: Group Objects - https://learn.microsoft.com/en-us/windows/win32/ad/group-objects (6 min)\n   Key concepts to note:\n   • cn is the group's Common-Name, its relative distinguished name, and must be unique among sibling objects\n   • member is a multi-valued attribute of DNs; items are linked references AD updates on move/rename\n   • groupType is an integer bitmask indicating scope (domain local/global/universal) and security flag",
      "Practice: Review a sample Active Directory Objects and Attributes: Users, Computers, and Groups policy and identify what it allows/denies (15 min)",
      "Self-test: Without looking at notes, explain Active Directory Objects and Attributes: Users, Computers, and Groups to an imaginary coworker in 2-3 sentences (5 min)"
    ],
    "completion_check": "Can explain Active Directory Objects and Attributes: Users, Computers, and Groups in your own words and completed the practice exercise",
    "resource_refs": [
      "https://learn.microsoft.com/en-us/windows-server/identity/ad-ds/manage/manage-user-accounts-with-active-directory-users-and-computers-in-windows-server",
      "https://learn.microsoft.com/en-us/windows/win32/ad/group-objects",
      "https://www.youtube.com/watch?v=f-29E2nU5sE"
    ],
    "domain": "Active Directory",
    "subdomain": "Active Directory Objects and Attributes: Users, Computers, and Groups",
    "subdomains_covered": [
      "Active Directory Objects and Attributes: Users, Computers, and Groups"
    ],
    "subtopics": [],
    "day_number": null
  },
  {
    "step_id": "day-03",
    "step_type": "INFO",
    "title": "Organizational Units and Delegation of Control in Active Directory",
    "estimated_time_minutes": 25,
    "goal": "Learn about Organizational Units and Delegation of Control in Active Directory and understand: OUs let you delegate administration of user and computer objects to specific people or groups.",
    "actions": [
      "Read: Delegating Administration by Using OU Objects - https://learn.microsoft.com/en-us/windows-server/identity/ad-ds/plan/delegating-administration-by-using-ou-objects (5 min)\n   Key concepts to note:\n   • OUs let you delegate administration of user and computer objects to specific people or groups\n   • Delegation: put admins in a group, place objects in an OU, then delegate OU tasks to that group\n   • AD DS supports granular delegation: full control, create/delete/manage accounts, or only reset passwords",
      "Practice: Follow along with a basic Organizational Units and Delegation of Control in Active Directory configuration example (15 min)",
      "Self-test: Without looking at notes, explain Organizational Units and Delegation of Control in Active Directory to an imaginary coworker in 2-3 sentences (5 min)"
    ],
    "completion_check": "Can explain Organizational Units and Delegation of Control in Active Directory in your own words and completed the practice exercise",
    "resource_refs": [
      "https://learn.microsoft.com/en-us/windows-server/identity/ad-ds/plan/delegation-of-control-in-ad-ds",
      "https://activedirectorypro.com/delegate-control-active-directory/",
      "https://www.youtube.com/watch?v=kS-q83-k56Q"
    ],
    "domain": "Active Directory",
    "subdomain": "Organizational Units and Delegation of Control in Active Directory",
    "subdomains_covered": [
      "Organizational Units and Delegation of Control in Active Directory"
    ],
    "subtopics": [],
    "day_number": null
  },
  {
    "step_id": "day-04",
    "step_type": "INFO",
    "title": "Active Directory Group Types and Scope Management",
    "estimated_time_minutes": 31,
    "goal": "Learn about Active Directory Group Types and Scope Management and understand: Security groups collect user accounts, computer accounts, and other groups into manageable units.",
    "actions": [
      "Read: Active Directory Security Groups - https://learn.microsoft.com/en-us/windows-server/identity/ad-ds/manage/understand-security-groups (11 min)\n   Key concepts to note:\n   • Security groups collect user accounts, computer accounts, and other groups into manageable units\n   • Active Directory group types: Security groups and Distribution groups\n   • Security groups assign permissions and user rights to resources and users",
      "Practice: Follow along with a basic Active Directory Group Types and Scope Management configuration example (15 min)",
      "Self-test: Without looking at notes, explain Active Directory Group Types and Scope Management to an imaginary coworker in 2-3 sentences (5 min)"
    ],
    "completion_check": "Can explain Active Directory Group Types and Scope Management in your own words and completed the practice exercise",
    "resource_refs": [
      "https://learn.microsoft.com/en-us/windows-server/identity/ad-ds/manage/understand-security-groups",
      "https://www.youtube.com/watch?v=1-4_sJ5-h8c",
      "https://adamtheautomator.com/manage-active-directory-groups-powershell/"
    ],
    "domain": "Active Directory",
    "subdomain": "Active Directory Group Types and Scope Management",
    "subdomains_covered": [
      "Active Directory Group Types and Scope Management"
    ],
    "subtopics": [],
    "day_number": null
  },
  {
    "step_id": "day-05",
    "step_type": "INFO",
    "title": "Active Directory Authentication and Kerberos Ticketing",
    "estimated_time_minutes": 25,
    "goal": "Learn about Active Directory Authentication and Kerberos Ticketing and understand: Kerberos is an authentication protocol used to verify user or host identities in Windows domains.",
    "actions": [
      "Read: Kerberos authentication overview - https://learn.microsoft.com/en-us/windows-server/security/kerberos/kerberos-authentication-overview (5 min)\n   Key concepts to note:\n   • Kerberos is an authentication protocol used to verify user or host identities in Windows domains\n   • Windows implements Kerberos V5 plus extensions for public-key authentication, authz data transport, and delegation\n   • The Kerberos client is a Security Support Provider (SSP) accessed through the Security Support Provider Interface (SSPI)",
      "Practice: Try 2-3 of the commands mentioned in the Active Directory Authentication and Kerberos Ticketing documentation (15 min)",
      "Self-test: Without looking at notes, explain Active Directory Authentication and Kerberos Ticketing to an imaginary coworker in 2-3 sentences (5 min)"
    ],
    "completion_check": "Can explain Active Directory Authentication and Kerberos Ticketing in your own words and completed the practice exercise",
    "resource_refs": [
      "https://learn.microsoft.com/en-us/windows-server/security/kerberos/kerberos-authentication-overview",
      "https://medium.com/@carl.david.n/building-a-beginner-friendly-hands-on-active-directory-lab-e44333959143",
      "https://www.cbtnuggets.com/blog/technology/system-admin/how-kerberos-works-in-windows-active-directory"
    ],
    "domain": "Active Directory",
    "subdomain": "Active Directory Authentication and Kerberos Ticketing",
    "subdomains_covered": [
      "Active Directory Authentication and Kerberos Ticketing"
    ],
    "subtopics": [],
    "day_number": null
  },
  {
    "step_id": "day-06",
    "step_type": "BOSS",
    "title": "BOSS: Active Directory Synthesis",
    "estimated_time_minutes": 55,
    "goal": "Put your Active Directory knowledge together with a practical challenge.",
    "actions": [
      "Quick review: Skim your notes from previous Active Directory days. What are the key concepts?",
      "Mini-scenario: Design a simple AD structure for a company with 3 departments. Show: OUs, one GPO per department, and delegation for helpdesk",
      "Self-assessment: What clicked? What's still fuzzy? What would you like to explore more?"
    ],
    "completion_check": "Completed the Active Directory challenge and can connect different concepts together",
    "resource_refs": [
      "https://learn.microsoft.com/en-us/windows-server/identity/ad-ds/get-started/replication/active-directory-replication-concepts",
      "https://thebakersfoundry.com/my-multi-site-ad-lab-end-to-end/"
    ],
    "domain": "Active Directory",
    "subdomain": "Active Directory Sites, Subnets, and Replication Topology",
    "subdomains_covered": [
      "Active Directory Sites, Subnets, and Replication Topology"
    ],
    "subtopics": [],
    "day_number": null
  }
]