{
  "workflows": {
    "wf-b2b6529a": {
      "id": "wf-b2b6529a",
      "name": "test1",
      "steps": [
        {
          "id": "wf-b2b6529a-step-1",
          "title": "Define Testing Scope and Success Criteria",
          "description": "Clarify what needs to be tested within 5 days, including features, components, and platforms. Define success criteria such as coverage targets, defect thresholds, and priority areas so that time is focused on the most critical functionality.",
          "meta": {}
        },
        {
          "id": "wf-b2b6529a-step-2",
          "title": "Gather Requirements and Test Artifacts",
          "description": "Collect specifications, user stories, acceptance criteria, design documents, and any existing test cases. Confirm assumptions with stakeholders to resolve ambiguities and ensure the tests align with real requirements.",
          "meta": {}
        },
        {
          "id": "wf-b2b6529a-step-3",
          "title": "Create a 5-Day Test Schedule",
          "description": "Break the 5-day window into daily objectives, assigning specific features and test activities to each day. Allocate time for preparation, execution, defect triage, retesting, and buffer for unexpected issues.",
          "meta": {}
        },
        {
          "id": "wf-b2b6529a-step-4",
          "title": "Set Up Test Environment and Data",
          "description": "Prepare the testing environment, including hardware, software, configurations, and integrations. Create or refresh test data sets (normal, boundary, negative) and verify that the environment is stable and mirrors production as closely as feasible.",
          "meta": {}
        },
        {
          "id": "wf-b2b6529a-step-5",
          "title": "Identify and Prioritize Test Scenarios",
          "description": "List key user flows, edge cases, and system-level interactions to test. Prioritize them by risk, business impact, and likelihood of failure so that the most critical scenarios are guaranteed coverage within the 5-day window.",
          "meta": {}
        },
        {
          "id": "wf-b2b6529a-step-6",
          "title": "Design Test Cases for High-Priority Areas",
          "description": "Draft detailed test cases for the highest-priority scenarios, including preconditions, steps, expected results, and data. Focus first on core functionality, critical paths, and areas with recent changes or known instability.",
          "meta": {}
        },
        {
          "id": "wf-b2b6529a-step-7",
          "title": "Prepare Regression and Smoke Test Sets",
          "description": "Define a small smoke test suite to quickly validate basic system health each day and a focused regression set that covers core functionality. Ensure these suites are lean enough to execute within the time constraints.",
          "meta": {}
        },
        {
          "id": "wf-b2b6529a-step-8",
          "title": "Execute Initial Smoke Tests",
          "description": "Run the smoke tests in the prepared environment to validate basic stability before deeper testing. If smoke tests fail, pause broader execution and work with the team to resolve blocking issues quickly.",
          "meta": {}
        },
        {
          "id": "wf-b2b6529a-step-9",
          "title": "Execute Functional Tests by Priority",
          "description": "Begin executing test cases starting from the highest-priority features and flows. Log results meticulously, recording passed, failed, and blocked tests, along with evidence such as screenshots or logs where relevant.",
          "meta": {}
        },
        {
          "id": "wf-b2b6529a-step-10",
          "title": "Log and Triage Defects",
          "description": "For each failure, log a defect with clear reproduction steps, expected vs actual behavior, environment details, and severity. Triage defects with the team, prioritizing fixes that unblock additional testing or affect critical functionality.",
          "meta": {}
        },
        {
          "id": "wf-b2b6529a-step-11",
          "title": "Collaborate with Developers on Fixes",
          "description": "Work with developers to clarify defects and confirm impact. Provide additional information, retest quickly on patched builds, and update defect statuses to keep the feedback loop short during the 5-day period.",
          "meta": {}
        },
        {
          "id": "wf-b2b6529a-step-12",
          "title": "Perform Targeted Regression Testing",
          "description": "After fixes are delivered, execute the regression suite and any impacted tests around changed areas. Focus on ensuring that recent fixes did not introduce new issues or break existing functionality.",
          "meta": {}
        },
        {
          "id": "wf-b2b6529a-step-13",
          "title": "Monitor Daily Progress Against Plan",
          "description": "At the end of each day, review executed tests, remaining scope, defect trends, and environment issues. Adjust the plan for the next day, re-prioritizing where necessary to stay aligned with the 5-day goal.",
          "meta": {}
        },
        {
          "id": "wf-b2b6529a-step-14",
          "title": "Conduct Exploratory Testing Sessions",
          "description": "Reserve time for structured exploratory testing on critical and complex areas of the system. Use charters or time-boxed sessions to uncover unexpected behaviors that scripted test cases might miss.",
          "meta": {}
        },
        {
          "id": "wf-b2b6529a-step-15",
          "title": "Validate Non-Functional Aspects (Basic)",
          "description": "Within time constraints, perform lightweight checks on performance, usability, and security where feasible. Focus on smoke-level non-functional tests that can quickly reveal major issues impacting user experience.",
          "meta": {}
        },
        {
          "id": "wf-b2b6529a-step-16",
          "title": "Consolidate Test Results and Metrics",
          "description": "Aggregate executed vs planned test cases, pass/fail rates, defect counts by severity, and outstanding risks. Summarize which areas received full, partial, or no coverage within the 5-day period.",
          "meta": {}
        },
        {
          "id": "wf-b2b6529a-step-17",
          "title": "Assess Risk and Remaining Gaps",
          "description": "Identify untested or partially tested areas, known open defects, and any environment or data limitations that impacted testing. Clearly describe residual risks and their potential business impact.",
          "meta": {}
        },
        {
          "id": "wf-b2b6529a-step-18",
          "title": "Prepare Test Summary Report",
          "description": "Document the overall testing scope, approach, timeline, key findings, metrics, and major defects. Highlight blockers, mitigations, and recommendations, tailoring the report to the stakeholders’ decision-making needs.",
          "meta": {}
        },
        {
          "id": "wf-b2b6529a-step-19",
          "title": "Review Outcomes with Stakeholders",
          "description": "Present the results to product owners, developers, and other stakeholders. Discuss whether the system meets the defined success criteria, the impact of open issues, and whether additional testing or fixes are required.",
          "meta": {}
        },
        {
          "id": "wf-b2b6529a-step-20",
          "title": "Capture Lessons Learned and Improve",
          "description": "Reflect on what worked and what did not in the 5-day testing effort. Note improvements for future short-cycle testing, such as better environment preparation, earlier risk-based prioritization, or automation opportunities.",
          "meta": {}
        }
      ],
      "current_step": 2,
      "status": "paused",
      "created_at": "2025-12-04T19:20:41.806183+00:00",
      "last_updated": "2025-12-04T19:22:14.235996+00:00",
      "meta": {
        "source": "compose",
        "goal": "testing in 5 days",
        "session_id": "default"
      }
    },
    "wf-e3e872c2": {
      "id": "wf-e3e872c2",
      "name": "Cybersecurity",
      "steps": [
        {
          "id": "wf-e3e872c2-step-1",
          "title": "Day 1 – Foundations of Identity, Authentication, and Directory Services",
          "description": "Build the conceptual base needed to understand why Active Directory (AD) exists and how it fits into cybersecurity.\n\n1. Identity & Access Management (IAM) Basics\n   - Define key concepts: identity, authentication, authorization, accounting (AAA).\n   - Understand the difference between identification (who you claim to be) and authentication (proving it).\n   - Compare common authentication methods: passwords, MFA, smart cards, biometrics, tokens.\n   - Learn what Single Sign-On (SSO) is and why enterprises use it.\n\n2. What is a Directory Service?\n   - Understand what a directory is (a structured, searchable database of objects and attributes).\n   - See how directory services differ from regular databases (optimized for read/lookup, hierarchical structure).\n   - Learn about LDAP (Lightweight Directory Access Protocol):\n     - What LDAP is used for.\n     - Basic LDAP concepts: entries, attributes, distinguished names (DNs), directory information tree (DIT).\n\n3. AD in the Context of Cybersecurity\n   - Understand the role of AD in a Windows enterprise network:\n     - Centralized authentication.\n     - Centralized authorization and policy management.\n   - Why AD is critical for security:\n     - Single point of control for user and machine accounts.\n     - Common target for attackers (domain dominance = environment dominance).\n   - Overview of major AD-related security incidents (e.g., domain takeover, ransomware using AD).\n\n4. Environment Overview\n   - Distinguish between Standalone PCs vs. Workgroup vs. Domain-Joined machines.\n   - Understand where AD typically lives: corporate networks, schools, government.\n   - Know basic Windows components that interact with AD: clients, servers, domain controllers.\n\n5. Quick Check & Reflection\n   - Be able to verbally explain:\n     - Why organizations need centralized identity and policy management.\n     - What a directory service is.\n     - How IAM and directory services connect to cybersecurity.\n   - Write 5–10 bullet points summarizing why compromising AD is so valuable to attackers.",
          "meta": {}
        },
        {
          "id": "wf-e3e872c2-step-2",
          "title": "Day 2 – Core Active Directory Concepts and Architecture",
          "description": "Learn AD’s structure, terminology, and how it logically organizes an enterprise.\n\n1. What is Active Directory (AD)?\n   - Define Active Directory Domain Services (AD DS).\n   - Understand AD as a Microsoft implementation of a directory service using LDAP, Kerberos, and other protocols.\n   - Differentiate between AD DS and other related technologies:\n     - AD LDS (Lightweight Directory Services).\n     - AD FS (Federation Services).\n     - Active Directory Certificate Services (AD CS).\n\n2. Logical Structure of AD\n   - Forests, Trees, Domains:\n     - Forest: the top-level security boundary and schema.\n     - Tree: one or more domains in a contiguous namespace.\n     - Domain: administrative and security boundary where policies and authentication are applied.\n   - Organizational Units (OUs):\n     - Purpose of OUs for logical grouping and delegation.\n     - Example OU structures (by department, location, function, etc.).\n   - Objects and Attributes:\n     - Common object types: users, groups, computers, printers, service accounts.\n     - Attributes: name, SID, group memberships, email, etc.\n\n3. Physical Structure of AD\n   - Domain Controllers (DCs):\n     - Their role as authentication and directory servers.\n     - Why you typically have multiple DCs (redundancy, load distribution).\n   - Sites and Subnets:\n     - How AD uses sites to optimize replication and authentication traffic.\n     - Relationship between physical network topology and AD sites.\n   - Global Catalog (GC):\n     - What the GC is.\n     - Its role in forest-wide searches and logons.\n\n4. AD Protocols and Authentication Overview\n   - Kerberos:\n     - High-level understanding (tickets, Key Distribution Center (KDC) on DCs).\n     - Why Kerberos is preferred over NTLM.\n   - NTLM (legacy protocol) and why it’s still around.\n   - LDAP for querying and updating directory information.\n\n5. Hands-On (Conceptual / Diagram-Based)\n   - Draw a simple AD environment:\n     - 1 forest, 1 domain, several OUs, a few users, groups, and computers.\n   - Label DCs, Sites, and show where authentication and replication happen.\n   - Write short definitions (1–2 sentences) for: Forest, Domain, OU, DC, Object, Attribute, GC, Site.",
          "meta": {}
        },
        {
          "id": "wf-e3e872c2-step-3",
          "title": "Day 3 – Users, Groups, Policies, and Day-to-Day AD Operations",
          "description": "Understand how administrators manage identities and enforce security through AD in daily operations.\n\n1. AD User and Computer Accounts\n   - User Accounts:\n     - Types: regular users, admins, service accounts.\n     - Key properties: username, UPN, password policies, group memberships.\n   - Computer Accounts:\n     - Purpose of computer accounts for domain-joined machines.\n     - How computer accounts participate in authentication.\n\n2. Groups and Access Control\n   - Group Types:\n     - Security vs. distribution groups.\n     - Group scope: domain local, global, universal.\n   - Access control and permissions:\n     - How groups are used to grant access to files, folders, applications, and resources.\n     - Basics of ACLs (Access Control Lists) and ACEs (Access Control Entries).\n   - Best-practice pattern: AGDLP/AGUDLP (Accounts → Global Groups → Domain Local Groups → Permissions).\n\n3. Group Policy (GPOs)\n   - What Group Policy is and why it matters:\n     - Centralized configuration and security settings for users and computers.\n   - GPO inheritance and processing order:\n     - Local → Site → Domain → OU (LSDOU).\n     - Link order and enforced/block inheritance concepts.\n   - Examples of policies:\n     - Password and account lockout policies.\n     - Software installation and updates.\n     - Security settings (firewall rules, RDP access, USB restrictions).\n\n4. Common Administrative Tasks\n   - Joining a computer to a domain (conceptually or via example command/UI).\n   - Creating users and groups and resetting passwords.\n   - Moving objects into OUs to apply specific policies.\n   - Auditing and logging basics:\n     - Where AD logs events (Event Viewer categories: Security, Directory Services, System).\n\n5. Practical / Lab-Oriented Activities (Conceptual or with a Test Environment)\n   - If you have a lab:\n     - Create a new OU structure for an imaginary company.\n     - Create test users and groups and assign them to folders or shares.\n     - Link a GPO to an OU and apply a simple setting (e.g., desktop wallpaper, password policy).\n   - If you don’t have a lab:\n     - Watch a step-by-step demonstration video of the above tasks.\n     - Document each admin task in your own words, including: purpose, steps, and potential security impact.",
          "meta": {}
        },
        {
          "id": "wf-e3e872c2-step-4",
          "title": "Day 4 – Active Directory Security, Common Attack Paths, and Hardening",
          "description": "Focus on AD from a cybersecurity perspective: how it’s attacked and how it should be defended.\n\n1. AD as a High-Value Target\n   - Understand the concept of \"domain dominance\":\n     - If an attacker gets Domain Admin or equivalent privileges, they effectively own the environment.\n   - Typical attacker goals:\n     - Credential theft and reuse.\n     - Privilege escalation.\n     - Persistence and stealthy control (backdoors, scheduled tasks, GPO abuse).\n\n2. Common AD Attack Techniques (High-Level)\n   - Credential-Related Attacks:\n     - Password spraying and brute force.\n     - Pass-the-Hash and Pass-the-Ticket (Kerberos ticket abuse).\n     - Credential dumping (e.g., from LSASS, DC database).\n   - Enumeration and Discovery:\n     - Using standard tools (e.g., whoami, net.exe, PowerShell) to learn about domain structure.\n     - BloodHound-style graph analysis (conceptual overview) to find attack paths.\n   - Privilege Escalation and Lateral Movement:\n     - Targeting misconfigured privileges on groups, OUs, and GPOs.\n     - Taking over service accounts or Tier 0 assets (DCs, PKI, admin workstations).\n\n3. AD Hardening Fundamentals\n   - Account and Credential Security:\n     - Enforce strong password and lockout policies.\n     - Use Multi-Factor Authentication (MFA) for privileged accounts.\n     - Restrict use of Domain Admin accounts (just-in-time, just-enough administration).\n   - Network and Host Hardening:\n     - Segmenting networks and controlling RDP/PowerShell remoting.\n     - Limiting where admin credentials can be used (admin workstations, privileged access workstations).\n   - AD Configuration and Policy Hardening:\n     - Minimizing membership in high-privilege groups (Domain Admins, Enterprise Admins).\n     - Securing GPOs and delegation, controlling who can link and modify policies.\n     - Disabling or limiting legacy protocols (e.g., NTLM where possible).\n\n4. Monitoring, Detection, and Incident Response in AD\n   - Key logs and events to monitor:\n     - Logon events, account lockouts, group membership changes, GPO modifications.\n   - Use of SIEM or log aggregation tools to detect AD-related anomalies.\n   - Basic incident response ideas for AD compromise:\n     - Containment of compromised accounts.\n     - Resetting KRBTGT account (conceptual understanding).\n     - Long-term remediation and re-architecting if AD is fully compromised.\n\n5. Synthesis Exercise\n   - Create a short written scenario:\n     - Describe an example AD attack path (from compromised user workstation to Domain Admin).\n     - Then list at least 5 defensive controls that could have interrupted or detected the attack.\n   - Identify 3 AD security best practices you consider highest priority and explain why.",
          "meta": {}
        },
        {
          "id": "wf-e3e872c2-step-5",
          "title": "Day 5 – Modern AD, Azure AD / Entra ID, and Review",
          "description": "Connect AD knowledge to modern hybrid environments, clarify terminology, and consolidate what you’ve learned.\n\n1. On-Prem AD vs. Azure AD / Entra ID\n   - Understand traditional on-prem Active Directory Domain Services (AD DS).\n   - Learn about Azure Active Directory (now part of Microsoft Entra ID):\n     - Cloud-based identity and access management service.\n     - Differences from on-prem AD DS: no traditional OUs, GPOs, or domain join in the same way.\n   - Typical integration patterns:\n     - Hybrid identity (synchronizing on-prem accounts to Azure AD/Entra ID).\n     - Single sign-on to cloud apps (Microsoft 365, SaaS applications).\n\n2. Modern Identity Security Concepts\n   - Conditional Access:\n     - What it is and how it builds on AD/Azure AD identities (device compliance, user risk, location, etc.).\n   - Zero Trust principles as they relate to AD:\n     - Never trust, always verify, and assume breach.\n     - Continuous authentication and authorization versus perimeter-based security.\n   - Role of identity governance:\n     - Lifecycle of accounts: joiners, movers, leavers.\n     - Access reviews and least privilege.\n\n3. Putting It All Together: AD in a Typical Enterprise\n   - Walk through a day-in-the-life of a user and an admin:\n     - User logon to a domain-joined workstation (Kerberos, GPOs applied).\n     - Access to on-prem resources (file shares, applications) via AD.\n     - Access to cloud resources (e.g., Microsoft 365) via synchronized identity.\n   - Show the flow of identity from on-prem AD to cloud services.\n\n4. Comprehensive Review\n   - Summarize key concepts from Days 1–4:\n     - IAM basics and directory services.\n     - AD architecture: forests, domains, OUs, DCs, objects.\n     - Daily operations: users, groups, computers, GPOs.\n     - Security: common attack paths and hardening strategies.\n   - Create your own mind map or diagram of AD and surrounding components, including:\n     - On-prem AD DS, domain controllers, clients.\n     - Azure AD/Entra ID, cloud apps, and synchronization.\n\n5. Self-Assessment and Next Steps\n   - Self-quiz:\n     - Write and answer at least 15–20 questions covering terminology, architecture, security, and modern identity.\n     - Identify any weak spots and note topics for deeper study (e.g., Kerberos internals, BloodHound, advanced GPOs).\n   - Plan continued learning:\n     - Choose one focus path (e.g., AD administration, red teaming/AD attacks, blue teaming/defensive monitoring).\n     - List 3–5 resources (courses, books, labs, or tools) you will use to deepen your AD and identity security skills over the next month.",
          "meta": {}
        }
      ],
      "current_step": 0,
      "status": "paused",
      "created_at": "2025-12-04T19:32:00.225787+00:00",
      "last_updated": "2025-12-04T19:37:14.087009+00:00",
      "meta": {
        "source": "compose",
        "goal": "i want to learn what active directory is in 5 days. create a detailed lesson plan that is only 5 steps long of various topics i want to learn.",
        "session_id": "default"
      }
    }
  },
  "last_saved": "2025-12-04T19:37:14.087307+00:00"
}